In [1]:
import pandas as pd 
import numpy as np

In [3]:
pd.__version__

'1.0.1'

# 文件读取和写入

In [ ]:
# 文件读取
pd.read_csv()

pd.read_table()

pd.read_excel()

In [ ]:
# 文件写入
df.to_csv()

df.to_excel()

# 基本数据结构

## Series

series最常用的属性：值（values）、索引（index）、名字（name）、类型（dtype）

In [9]:
s = pd.Series(data=[1,2,3,4],index=['a','b','c','d'],dtype='int8',name='这是一个series')

In [11]:
s.values

array([1, 2, 3, 4], dtype=int8)

In [12]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [13]:
s.dtype

dtype('int8')

Series中可以调用的方法：

In [18]:
[attr for attr in dir(s) if not attr.startswith('_')]

['T',
 'a',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'attrs',
 'autocorr',
 'axes',
 'b',
 'between',
 'between_time',
 'bfill',
 'bool',
 'c',
 'clip',
 'combine',
 'combine_first',
 'convert_dtypes',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'd',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'ge',
 'get',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'iteritems',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_markdown',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

## Data Frame

### 创建DF

In [20]:
df = pd.DataFrame(data={'col1':list('abcde'),'col2':[1,2,3,4,5]},index=list('一二三四五'))

In [21]:
df

  col1  col2
一    a     1
二    b     2
三    c     3
四    d     4
五    e     5

In [22]:
df['col1']

一    a
二    b
三    c
四    d
五    e
Name: col1, dtype: object

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
type(df['col1'])

pandas.core.series.Series

### 修改行或列名

In [28]:
df.rename(index={'一':1},columns={'col2':'new_col2'},inplace=True)

### 调用属性和方法

In [31]:
df.index

Index([1, '二', '三', '四', '五'], dtype='object')

In [32]:
df.columns

Index(['col1', 'new_col2'], dtype='object')

In [33]:
df.values

array([['a', 1],
       ['b', 2],
       ['c', 3],
       ['d', 4],
       ['e', 5]], dtype=object)

In [34]:
df.shape

(5, 2)

In [35]:
df.mean()

new_col2    3.0
dtype: float64

### 索引对齐特性

In [36]:
df1 = pd.DataFrame({'A':[1,2,3]},index=[1,2,3])
df2 = pd.DataFrame({'A':[1,2,3]},index=[3,1,2])

In [38]:
# 由于索引对齐，因此结果不是0
df1-df2

   A
1 -1
2 -1
3  2

### 列的删除与添加

删除可以用drop,del或者pop

In [40]:
df.drop(index='五',columns='col1') # inplace 默认为 false

   new_col2
1         1
二         2
三         3
四         4

In [41]:
del df['col1'] #删除的是原数据的列

In [42]:
df

   new_col2
1         1
二         2
三         3
四         4
五         5

In [43]:
df['col1'] = [1,2,3,4,5]

In [44]:
df.pop('col1')

1    1
二    2
三    3
四    4
五    5
Name: col1, dtype: int64

In [45]:
df

   new_col2
1         1
二         2
三         3
四         4
五         5

pop：直接在原数据上删除，并且返回被删除的列

### 增加新的列

可以直接增加新的列，也可以使用assign方法。

In [48]:
df.assign(C=pd.Series(data=[2,3,4,5,6]))

   new_col2    C
1         1  3.0
二         2  NaN
三         3  NaN
四         4  NaN
五         5  NaN

assign方法不会对原DF进行修改

### 根据列类型选择列

In [49]:
df.select_dtypes(include=['number'])

   new_col2
1         1
二         2
三         3
四         4
五         5

### 将series转换为DF

In [50]:
df.mean()

new_col2    3.0
dtype: float64

In [52]:
df.mean().to_frame(name='DF-Mean')

          DF-Mean
new_col2      3.0

# 常用基本函数

In [53]:
df = pd.read_csv('../data/table.csv')

## tail & head

## unique & nunique

In [54]:
df['Physics'].nunique()

7

In [56]:
df['Physics'].unique()

array(['A+', 'B+', 'B-', 'A-', 'B', 'A', 'C'], dtype=object)

## count & value_counts

In [57]:
# count 返回非缺失值元素个数
df['Physics'].count()

35

In [58]:
df['Physics'].value_counts()

B+    9
B     8
B-    6
A     4
A+    3
A-    3
C     2
Name: Physics, dtype: int64

## describe & info

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   School   35 non-null     object
 1   Class    35 non-null     object
 2   ID       35 non-null     int64
 3   Gender   35 non-null     object
 4   Address  35 non-null     object
 5   Height   35 non-null     int64
 6   Weight   35 non-null     int64
 7   Math     35 non-null     float64
 8   Physics  35 non-null     object
dtypes: float64(1), int64(3), object(5)
memory usage: 2.6+ KB

In [60]:
df.describe()

               ID      Height      Weight       Math
count    35.00000   35.000000   35.000000  35.000000
mean   1803.00000  174.142857   74.657143  61.351429
std     536.87741   13.541098   12.895377  19.915164
min    1101.00000  155.000000   53.000000  31.500000
25%    1204.50000  161.000000   63.000000  47.400000
50%    2103.00000  173.000000   74.000000  61.700000
75%    2301.50000  187.500000   82.000000  77.100000
max    2405.00000  195.000000  100.000000  97.000000

In [61]:
df.describe(percentiles=[.5,.6,.7])

               ID      Height      Weight       Math
count    35.00000   35.000000   35.000000  35.000000
mean   1803.00000  174.142857   74.657143  61.351429
std     536.87741   13.541098   12.895377  19.915164
min    1101.00000  155.000000   53.000000  31.500000
50%    2103.00000  173.000000   74.000000  61.700000
60%    2201.40000  175.400000   79.200000  67.980000
70%    2204.80000  186.800000   81.800000  72.280000
max    2405.00000  195.000000  100.000000  97.000000

## idxmax & nlargest

In [64]:
# idxmax/idxmin返回最大值/最小值的索引
df['Math'].idxmax()

5

In [65]:
df['Math'].nlargest(3)

5     97.0
28    95.5
11    87.7
Name: Math, dtype: float64

## clip & replace

In [68]:
# clip是对超过或者低于某些值的数进行截断
df['Math'].clip(70,80).head()

0    70.0
1    70.0
2    80.0
3    80.0
4    80.0
Name: Math, dtype: float64

In [70]:
# replace是对某些值进行替换
df['Address'].replace(['street_1','street_2'],['one','two']).head()

0         one
1         two
2         two
3         two
4    street_4
Name: Address, dtype: object

In [72]:
df.replace({'Address':{'street_1':'one','street_2':'two'}}).head() # 使用字典进行replace

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M       one     173      63  34.0      A+
1    S_1   C_1  1102      F       two     192      73  32.5      B+
2    S_1   C_1  1103      M       two     186      82  87.2      B+
3    S_1   C_1  1104      F       two     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

## apply

In [73]:
# 对于series, apply可以迭代每一行的操作
df['Math'].apply(lambda x:str(x)+'!').head()

0    34.0!
1    32.5!
2    87.2!
3    80.4!
4    84.8!
Name: Math, dtype: object

In [76]:
# 对于DF,apply可以迭代每一列的操作
df.apply(lambda x:x.apply(lambda x:str(x)+'!')).head()

  School Class     ID Gender    Address Height Weight   Math Physics
0   S_1!  C_1!  1101!     M!  street_1!   173!    63!  34.0!     A+!
1   S_1!  C_1!  1102!     F!  street_2!   192!    73!  32.5!     B+!
2   S_1!  C_1!  1103!     M!  street_2!   186!    82!  87.2!     B+!
3   S_1!  C_1!  1104!     F!  street_2!   167!    81!  80.4!     B-!
4   S_1!  C_1!  1105!     F!  street_4!   159!    64!  84.8!     B+!

# 排序

## 索引排序

In [77]:
df.set_index('Math').head()

     School Class    ID Gender   Address  Height  Weight Physics
Math
34.0    S_1   C_1  1101      M  street_1     173      63      A+
32.5    S_1   C_1  1102      F  street_2     192      73      B+
87.2    S_1   C_1  1103      M  street_2     186      82      B+
80.4    S_1   C_1  1104      F  street_2     167      81      B-
84.8    S_1   C_1  1105      F  street_4     159      64      B+

In [78]:
df.set_index('Math').sort_index().head() #默认为ascending

     School Class    ID Gender   Address  Height  Weight Physics
Math
31.5    S_1   C_3  1301      M  street_4     161      68      B+
32.5    S_1   C_1  1102      F  street_2     192      73      B+
32.7    S_2   C_3  2302      M  street_5     171      88       A
33.8    S_1   C_2  1204      F  street_5     162      63       B
34.0    S_1   C_1  1101      M  street_1     173      63      A+

## 值排序

In [79]:
df.sort_values(by='Class').head()

   School Class    ID Gender   Address  Height  Weight  Math Physics
0     S_1   C_1  1101      M  street_1     173      63  34.0      A+
19    S_2   C_1  2105      M  street_4     170      81  34.2       A
18    S_2   C_1  2104      F  street_5     159      97  72.2      B+
16    S_2   C_1  2102      F  street_6     161      61  50.6      B+
15    S_2   C_1  2101      M  street_7     174      84  83.3       C

In [80]:
df.sort_values(by=['Address','Height']).head()
# 多个值排序，即先对第一层排，在第一层相同的情况下对第二层排序

   School Class    ID Gender   Address  Height  Weight  Math Physics
0     S_1   C_1  1101      M  street_1     173      63  34.0      A+
11    S_1   C_3  1302      F  street_1     175      57  87.7      A-
23    S_2   C_2  2204      M  street_1     175      74  47.2      B-
33    S_2   C_4  2404      F  street_2     160      84  67.7       B
3     S_1   C_1  1104      F  street_2     167      81  80.4      B-

# 问题与练习

【问题一】 Series和DataFrame有哪些常见属性和方法？

**Series** : apply, clip, count, cummax, comsum, drop_duplicate, dtype, groupby, mask, nlargest, nunique, sample

**DataFrame**: append, apply, assign, clip, columns, count, describe, merge, nlargest, pivot, pop, iloc, loc, hist, head, tail, value_counts, idxmax, replace, transform

In [112]:
a = pd.Series(data=[1,2,3,4,6])
print([attr for attr in dir(a) if not attr.startswith('_')])

['T', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'append', 'apply', 'argmax', 'argmin', 'argsort', 'array', 'asfreq', 'asof', 'astype', 'at', 'at_time', 'attrs', 'autocorr', 'axes', 'between', 'between_time', 'bfill', 'bool', 'clip', 'combine', 'combine_first', 'convert_dtypes', 'copy', 'corr', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'divmod', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtype', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'ewm', 'expanding', 'explode', 'factorize', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'floordiv', 'ge', 'get', 'groupby', 'gt', 'hasnans', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'interpolate', 'is_monotonic', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_unique', 'isin', 'isna', 'isnull', 'item', 'items', 'iteritems', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lt', 'mad', 'map', 'mask', 'max', 'mean', 'median', 'memory_usage', 'min', 'mod', 'mode', 'mul', 'multiply', 'name', 'nbytes', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pct_change', 'pipe', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'radd', 'rank', 'ravel', 'rdiv', 'rdivmod', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'repeat', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'searchsorted', 'sem', 'set_axis', 'shape', 'shift', 'size', 'skew', 'slice_shift', 'sort_index', 'sort_values', 'squeeze', 'std', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_frame', 'to_hdf', 'to_json', 'to_latex', 'to_list', 'to_markdown', 'to_numpy', 'to_period', 'to_pickle', 'to_sql', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tshift', 'tz_convert', 'tz_localize', 'unique', 'unstack', 'update', 'value_counts', 'values', 'var', 'view', 'where', 'xs']

In [86]:
print([attr for attr in dir(df) if not attr.startswith('_')])

['Address', 'Class', 'Gender', 'Height', 'ID', 'Math', 'Physics', 'School', 'T', 'Weight', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'append', 'apply', 'applymap', 'asfreq', 'asof', 'assign', 'astype', 'at', 'at_time', 'attrs', 'axes', 'between_time', 'bfill', 'bool', 'boxplot', 'clip', 'columns', 'combine', 'combine_first', 'convert_dtypes', 'copy', 'corr', 'corrwith', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'eval', 'ewm', 'expanding', 'explode', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'floordiv', 'from_dict', 'from_records', 'ge', 'get', 'groupby', 'gt', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'info', 'insert', 'interpolate', 'isin', 'isna', 'isnull', 'items', 'iteritems', 'iterrows', 'itertuples', 'join', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lookup', 'lt', 'mad', 'mask', 'max', 'mean', 'median', 'melt', 'memory_usage', 'merge', 'min', 'mod', 'mode', 'mul', 'multiply', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pct_change', 'pipe', 'pivot', 'pivot_table', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'query', 'radd', 'rank', 'rdiv', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'select_dtypes', 'sem', 'set_axis', 'set_index', 'shape', 'shift', 'size', 'skew', 'slice_shift', 'sort_index', 'sort_values', 'squeeze', 'stack', 'std', 'style', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_feather', 'to_gbq', 'to_hdf', 'to_html', 'to_json', 'to_latex', 'to_markdown', 'to_numpy', 'to_parquet', 'to_period', 'to_pickle', 'to_records', 'to_sql', 'to_stata', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tshift', 'tz_convert', 'tz_localize', 'unstack', 'update', 'values', 'var', 'where', 'xs']

【问题二】 value_counts会统计缺失值吗？

`Series.value_counts(self, normalize=False, sort=True, ascending=False, bins=None, dropna=True)`

dropna默认为True，默认不会统计缺失值。

【问题三】 与idxmax和nlargest功能相反的是哪两组函数？

idxmin

nsmallest

【问题四】 在常用函数一节中，由于一些函数的功能比较简单，因此没有列入，现在将它们列在下面，请分别说明它们的用途并尝试使用。
sum/mean/median/mad/min/max/abs/std/var/quantile/cummax/cumsum/cumprod

In [97]:
df.sum(axis=0) #axis=1 by row

School     S_1S_1S_1S_1S_1S_1S_1S_1S_1S_1S_1S_1S_1S_1S_1S...
Class      C_1C_1C_1C_1C_1C_2C_2C_2C_2C_2C_3C_3C_3C_3C_3C...
ID                                                     63105
Gender                   MFMFFMFMFFMFMMFMFMFMMFMMFFMFFMFMFFF
Address    street_1street_2street_2street_2street_4street...
Height                                                  6095
Weight                                                  2613
Math                                                  2147.3
Physics    A+B+B+B-B+A-B-A+BB-B+A-BAB-CB+B-B+ABB+A+B-BB+A...
dtype: object

In [99]:
df.median(axis=0)

ID        2103.0
Height     173.0
Weight      74.0
Math        61.7
dtype: float64

In [100]:
df.mad()

ID        514.285714
Height     11.869388
Weight     10.733061
Math       16.924245
dtype: float64

In [116]:
df['Math'].cumprod().head()

0    3.400000e+01
1    1.105000e+03
2    9.635600e+04
3    7.747022e+06
4    6.569475e+08
Name: Math, dtype: float64

【问题五】 df.mean(axis=1)是什么意思？它与df.mean()的结果一样吗？第一问提到的函数也有axis参数吗？怎么使用？

In [111]:
df.mean(axis=1).head()

0    342.750
1    349.875
2    364.550
3    358.100
4    353.200
dtype: float64

axis设置为1，代表看的是行
axis设置为0，看的是列。

## 【练习一】

 现有一份关于美剧《权力的游戏》剧本的数据集，请解决以下问题：
（a）在所有的数据中，一共出现了多少人物？
（b）以单元格计数（即简单把一个单元格视作一句），谁说了最多的话？
（c）以单词计数，谁说了最多的单词？

In [117]:
dat = pd.read_csv('../data/Game_of_Thrones_Script.csv')

In [118]:
dat.head()

,Release Date,Season,Episode,Episode Title,Name,Sentence
0,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,What do you expect? They're savages. One lot s...
1,2011/4/17,Season 1,Episode 1,Winter is Coming,will,I've never seen wildlings do a thing like this...
2,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,How close did you get?
3,2011/4/17,Season 1,Episode 1,Winter is Coming,will,Close as any man would.
4,2011/4/17,Season 1,Episode 1,Winter is Coming,gared,We should head back to the wall.

In [121]:
dat.shape

(23911, 6)

In [120]:
# (a) 一共出现了多少人物
dat['Name'].nunique()

564

In [142]:
# (b) 谁说了最多的话？
dat['Name'].value_counts().index[0]

'tyrion lannister'

In [160]:
# (c) 谁说了最多的单词
dat['count_words'] = dat['Sentence'].apply(lambda x:len(x.split()))

In [165]:
dat.groupby(by='Name').sum()['count_words'].sort_values(ascending=False).index[0]

'tyrion lannister'

## 【练习二】

现有一份关于科比的投篮数据集，请解决如下问题：

（a）哪种action_type和combined_shot_type的组合是最多的？

（b）在所有被记录的game_id中，遭遇到最多的opponent是一个支？

In [166]:
kobe = pd.read_csv('../data/Kobe_data.csv',index_col='shot_id')

In [167]:
kobe.head()

,action_type,combined_shot_type,game_event_id,game_id,lat,loc_x,loc_y,lon,minutes_remaining,period,...,shot_made_flag,shot_type,shot_zone_area,shot_zone_basic,shot_zone_range,team_id,team_name,game_date,matchup,opponent
shot_id,,,,,,,,,,,,,,,,,,,,,
1,Jump Shot,Jump Shot,10,20000012,33.9723,167,72,-118.1028,10,1,...,NaN,2PT Field Goal,Right Side(R),Mid-Range,16-24 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
2,Jump Shot,Jump Shot,12,20000012,34.0443,-157,0,-118.4268,10,1,...,0.0,2PT Field Goal,Left Side(L),Mid-Range,8-16 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
3,Jump Shot,Jump Shot,35,20000012,33.9093,-101,135,-118.3708,7,1,...,1.0,2PT Field Goal,Left Side Center(LC),Mid-Range,16-24 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
4,Jump Shot,Jump Shot,43,20000012,33.8693,138,175,-118.1318,6,1,...,0.0,2PT Field Goal,Right Side Center(RC),Mid-Range,16-24 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
5,Driving Dunk Shot,Dunk,155,20000012,34.0443,0,0,-118.2698,6,2,...,1.0,2PT Field Goal,Center(C),Restricted Area,Less Than 8 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR

In [173]:
# （a）哪种action_type和combined_shot_type的组合是最多的？
kobe.groupby(by=['action_type','combined_shot_type']).count()['game_event_id'].sort_values(ascending=False).index[0]

('Jump Shot', 'Jump Shot')

In [175]:
kobe.groupby(by='opponent').count()['game_event_id'].sort_values(ascending=False).index[0]

'SAS'